import psycopg2

conn = psycopg2.connect(
    host="db",
    user="library_user",
    password="library_pass",
    database="library_db"
)

cur = conn.cursor()

cur.execute("""
INSERT INTO Books (author, title, section, year, pages, price, type, copies, max_days)
VALUES
('Іваненко І.', 'Основи Python', 'технічна', 2015, 320, 250.00, 'посібник', 5, 30),
('Коваленко П.', 'Алгоритми та структури даних', 'технічна', 2012, 410, 300.00, 'книга', 3, 30),
('Тарасенко Ю.', 'Економіка підприємства', 'економічна', 2018, 280, 220.00, 'посібник', 4, 20),
('Данилюк М.', 'Історія України', 'художня', 2005, 350, 150.00, 'книга', 6, 25),
('Бойко О.', 'Системи баз даних', 'технічна', 2020, 500, 450.00, 'посібник', 2, 40),
('Франко І.', 'Захар Беркут', 'художня', 1995, 220, 120.00, 'книга', 10, 15),
('Шевченко Т.', 'Кобзар', 'художня', 2000, 380, 180.00, 'книга', 8, 20),
('Руденко С.', 'Менеджмент організацій', 'економічна', 2017, 300, 200.00, 'посібник', 3, 20),
('Василенко Л.', 'Маркетинг', 'економічна', 2014, 260, 210.00, 'книга', 5, 25),
('Жук А.', 'Програмування на Java', 'технічна', 2019, 540, 400.00, 'посібник', 4, 30),
('Кравчук В.', 'Операційні системи', 'технічна', 2010, 430, 270.00, 'книга', 2, 25),
('Мельник П.', 'Бізнес-аналітика', 'економічна', 2021, 360, 350.00, 'періодичне видання', 3, 20),
('Гончар О.', 'Тронка', 'художня', 1993, 310, 140.00, 'книга', 6, 15),
('Лисенко А.', 'Мікроекономіка', 'економічна', 2016, 290, 240.00, 'періодичне видання', 4, 20);
""")

cur.execute("""
INSERT INTO Readers (ticket_number, last_name, first_name, phone, address, course, group_name)
VALUES
(101, 'Петренко', 'Андрій', '050-123-45-67', 'вул. Шевченка, 10', 1, 'ПІ-11'),
(102, 'Іванова', 'Марія', '067-111-22-33', 'вул. Грушевського, 25', 2, 'ПІ-21'),
(103, 'Коваль', 'Олег', '093-222-33-44', 'вул. Центральна, 7', 3, 'ПІ-31'),
(104, 'Шевченко', 'Ірина', '050-999-88-77', 'вул. Київська, 14', 1, 'ПІ-12'),
(105, 'Бондар', 'Олексій', '097-555-22-11', 'пр. Миру, 45', 4, 'ПІ-41'),
(106, 'Сидоренко', 'Юлія', '066-333-88-55', 'вул. Лесі Українки, 18', 2, 'ПІ-22'),
(107, 'Савченко', 'Дмитро', '093-777-66-55', 'пл. Свободи, 3', 3, 'ПІ-32'),
(108, 'Гринь', 'Катерина', '099-123-00-11', 'вул. Миру, 27', 4, 'ПІ-42'),
(109, 'Литвин', 'Роман', '068-444-55-66', 'вул. Соборна, 90', 1, 'ПІ-13');
""")

cur.execute("""
INSERT INTO Issues (issue_date, ticket_number, book_id)
VALUES
('2023-01-10', 101, 1),
('2023-01-12', 102, 3),
('2023-01-15', 103, 4),
('2023-01-20', 104, 2),
('2023-02-01', 105, 5),
('2023-02-05', 106, 7),
('2023-02-07', 107, 6),
('2023-02-10', 108, 9),
('2023-02-17', 109, 10),
('2023-02-20', 101, 11),
('2023-02-25', 102, 12);
""")

conn.commit()
cur.close()
conn.close()

print("Дані успішно вставлено")
